app/Controllers/Admin.php

    public function getUpdate($id): string
    {
        $userModel = new UserModel();
        $data['user'] = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'