app/Controllers/Auth.php

    public function login()
    {

        $userModel = new UserModel();

        if ($this->request->is('post')) {
            $email = $this->request->getPost('email');
            $email= strip_tags($email);
            $password = $this->request->getPost('password');
            $password= strip_tags($password);
            $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'rabe@test.com'
 LIMIT 1