app/Controllers/Item.php

SELECT *
FROM `categories`
---
    public function getFormCreate(): string
    {
        $categModel = new CategoryModel();
        $data['categories'] = $categModel->findAll();

SELECT *
FROM `items`
WHERE `items`.`id` = '13'
---
    public function getFormUpdate(): string
    {
        $itemModel = new ItemModel();
        $data['item'] = $itemModel->find($this->request->getPost("item_id"));

SELECT *
FROM `item_photos`
WHERE `item_id` = '13'
DELETE FROM `item_photos`
WHERE `id` IN ('8')
---
    public function deleteOldPhotos($itemId): void
    {
        $itemPhotoModel = new ItemPhotoModel();

        $oldPhotos = $itemPhotoModel->where('item_id', $itemId)->findAll();

        foreach ($oldPhotos as $photo) {
            $photoPath = FCPATH . 'uploads/' . $photo['photo_url'];

            if (file_exists($photoPath)) {
                unlink($photoPath);
            }

            $itemPhotoModel->delete($photo['id']);

DELETE FROM `items`
WHERE `id` IN ('26')
---
    public function delete($id): \CodeIgniter\HTTP\RedirectResponse
    {
        $itemModel = new ItemModel();
        $itemModel->delete($id);

SELECT *
FROM `categories`
SELECT *
FROM `items`
---
        ]);
        $userItems = $queryUserItems->getResultObject();

        return view('item/listItems', [
            'items' => $items,
            'userItems' => $userItems,
            'categories' => $categModel->findAll(),
        ]);

SELECT *
FROM `items`
WHERE `items`.`id` = '16'
---
    public function getHistory()
    {
        $db = db_connect();
        $item_id= $this->request->getPost("item_id");

        $db = db_connect();

        $sql = 'SELECT eh.exchange_date, u1.username AS previous_owner, u2.username AS new_owner
            FROM exchange_history eh
            JOIN users u1 ON eh.previous_owner_id = u1.id
            JOIN users u2 ON eh.new_owner_id = u2.id
            WHERE eh.item_id = ?
            ORDER BY eh.exchange_date DESC';

        $query = $db->query($sql, [$item_id]);
        $history = $query->getResultArray();
        $itemModel = new ItemModel();
        $item = $itemModel->find($item_id);