app/Controllers/Item.php

INSERT INTO `exchanges` (`offered_item_id`, `requested_item_id`, `status`) VALUES ('13', '15', 'proposed')
---
    public function exchange()
    {
        if (!$this->request->is("post")) {
            return redirect()->back()->with('error', 'Invalid request method.');
        }

        $itemModel = new ItemModel();
        $item = $itemModel->find($this->request->getPost("item_id"));
        if (!$item) {
            return redirect()->to('/error')->with('error', 'Item not found.');
        }

        $exchangeModel = new ExchangeModel();
        $exchangeData = [
            'offered_item_id' => strip_tags($this->request->getPost('offered_item_id')),
            'requested_item_id' => strip_tags($this->request->getPost('requested_item_id')),
            'status' => 'proposed',
        ];
        if ($exchangeModel->insert($exchangeData)) {