app/Controllers/User.php

SELECT *
FROM `users`
WHERE `users`.`id` = '5'
---
        public function dash(): string
        {
            $id = session()->get('user_id');

            $userModel = new UserModel();
            $data['user'] = $userModel->find($id);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function getUpdate(): string
    {
        $id=session()->get('user_id');
        $userModel = new UserModel();
        $data['user'] = $userModel->find($id);